     A*****************************************************************
     A* File Name : SLOTDF  ( Type - DSPF )
     A* Purpose   : Display File For Simulated Slot Machine
     A* Written   : N.Shankar
     A* Dated     : Oct. 22, 1997.
     A*****************************************************************
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A*
     A*****************************************************************
     A*
     A          R DUMMY
     A                                      ASSUME
     A                                  1  2' '
     A*
     A*****************************************************************
     A*
     A          R REC0
     A                                      OVERLAY
     A                                      KEEP
     A                                      FRCDTA
     A                                      CA03(03 'EXIT')
     A*
     A*  Display The 'Win Meter' Window
     A                                  2 66'WIN METER'
     A                                      DSPATR(HI)
     A                                      COLOR(TRQ)
     A                                  4 61'Credit'
     A            CREDIT         5Y 0O  4 72EDTCDE(P)
     A                                  6 61'Last Win'
     A            LSTWIN         5Y 0O  6 72EDTCDE(P)
     A                                  8 61'Curr.Win'
     A            CURWIN         5Y 0O  8 72EDTCDE(P)
     A                                 10 61'#Lines/Bet'
     A            #LBET          1Y 0O 10 77EDTCDE(3)
     A                                  1 59'*********************'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  2 59'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  2 79'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  3 59'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  3 79'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  4 59'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  4 79'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  5 59'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  5 79'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  6 59'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  6 79'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  7 59'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  7 79'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  8 59'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  8 79'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  9 59'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                  9 79'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                 10 59'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                 10 79'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                 11 59'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                 11 79'*'
     A                                      DSPATR(RI) COLOR(PNK)
     A                                 12 59'*********************'
     A                                      DSPATR(RI) COLOR(PNK)
     A*
     A*  Display The 'Spin Wheel/Lines' Panel
     A                                  2 13'                                  -
     A                                              '
     A                                      DSPATR(RI)
     A                                  3 13' '
     A                                      DSPATR(RI)
     A                                  3 27' '
     A                                      DSPATR(RI)
     A                                  3 40' '
     A                                      DSPATR(RI)
     A                                  3 54' '
     A                                      DSPATR(RI)
     A                                  4 13' '
     A                                      DSPATR(RI)
     A                                  4 27' '
     A                                      DSPATR(RI)
     A                                  4 40' '
     A                                      DSPATR(RI)
     A                                  4 54' '
     A                                      DSPATR(RI)
     A                                  5 13' '
     A                                      DSPATR(RI)
     A            L11C1          8A  O  5 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  41                                  DSPATR(ND)
     A                                  5 27' '
     A                                      DSPATR(RI)
     A            L11C2          8A  O  5 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  51                                  DSPATR(ND)
     A                                  5 40' '
     A                                      DSPATR(RI)
     A            L11C3          8A  O  5 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  61                                  DSPATR(ND)
     A                                  5 54' '
     A                                      DSPATR(RI)
     A                                  6  9'2'
     A  32                                  DSPATR(HI)
     A                                  6 13' -'
     A                                      DSPATR(RI)
     A            L12C1          8A  O  6 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  42                                  DSPATR(ND)
     A                                  6 26'---'
     A                                      DSPATR(RI)
     A            L12C2          8A  O  6 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  52                                  DSPATR(ND)
     A                                  6 39'---'
     A                                      DSPATR(RI)
     A            L12C3          8A  O  6 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  62                                  DSPATR(ND)
     A                                  6 53'- '
     A                                      DSPATR(RI)
     A                                  7 13' '
     A                                      DSPATR(RI)
     A            L13C1          8A  O  7 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  43                                  DSPATR(ND)
     A                                  7 27' '
     A                                      DSPATR(RI)
     A            L13C2          8A  O  7 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  53                                  DSPATR(ND)
     A                                  7 40' '
     A                                      DSPATR(RI)
     A            L13C3          8A  O  7 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  63                                  DSPATR(ND)
     A                                  7 54' '
     A                                      DSPATR(RI)
     A                                  8 13' '
     A                                      DSPATR(RI)
     A                                  8 27' '
     A                                      DSPATR(RI)
     A                                  8 40' '
     A                                      DSPATR(RI)
     A                                  8 54' '
     A                                      DSPATR(RI)
     A                                  9 13' '
     A                                      DSPATR(RI)
     A                                  9 27' '
     A                                      DSPATR(RI)
     A                                  9 40' '
     A                                      DSPATR(RI)
     A                                  9 54' '
     A                                      DSPATR(RI)
     A                                 10 13' '
     A                                      DSPATR(RI)
     A            L21C1          8A  O 10 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  44                                  DSPATR(ND)
     A                                 10 27' '
     A                                      DSPATR(RI)
     A            L21C2          8A  O 10 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  54                                  DSPATR(ND)
     A                                 10 40' '
     A                                      DSPATR(RI)
     A            L21C3          8A  O 10 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  64                                  DSPATR(ND)
     A                                 10 54' '
     A                                      DSPATR(RI)
     A                                 11  9'1'
     A  31                                  DSPATR(HI)
     A                                 11 13' -'
     A                                      DSPATR(RI)
     A            L22C1          8A  O 11 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  45                                  DSPATR(ND)
     A                                 11 26'---'
     A                                      DSPATR(RI)
     A            L22C2          8A  O 11 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  55                                  DSPATR(ND)
     A                                 11 39'---'
     A                                      DSPATR(RI)
     A            L22C3          8A  O 11 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  65                                  DSPATR(ND)
     A                                 11 53'- '
     A                                      DSPATR(RI)
     A                                 12 13' '
     A                                      DSPATR(RI)
     A            L23C1          8A  O 12 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  46                                  DSPATR(ND)
     A                                 12 27' '
     A                                      DSPATR(RI)
     A            L23C2          8A  O 12 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  56                                  DSPATR(ND)
     A                                 12 40' '
     A                                      DSPATR(RI)
     A            L23C3          8A  O 12 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  66                                  DSPATR(ND)
     A                                 12 54' '
     A                                      DSPATR(RI)
     A                                 13 13' '
     A                                      DSPATR(RI)
     A                                 13 27' '
     A                                      DSPATR(RI)
     A                                 13 40' '
     A                                      DSPATR(RI)
     A                                 13 54' '
     A                                      DSPATR(RI)
     A                                 14 13' '
     A                                      DSPATR(RI)
     A                                 14 27' '
     A                                      DSPATR(RI)
     A                                 14 40' '
     A                                      DSPATR(RI)
     A                                 14 54' '
     A                                      DSPATR(RI)
     A                                 15 13' '
     A                                      DSPATR(RI)
     A            L31C1          8A  O 15 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  47                                  DSPATR(ND)
     A                                 15 27' '
     A                                      DSPATR(RI)
     A            L31C2          8A  O 15 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  57                                  DSPATR(ND)
     A                                 15 40' '
     A                                      DSPATR(RI)
     A            L31C3          8A  O 15 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  67                                  DSPATR(ND)
     A                                 15 54' '
     A                                      DSPATR(RI)
     A                                 16  9'3'
     A  33                                  DSPATR(HI)
     A                                 16 13' -'
     A                                      DSPATR(RI)
     A            L32C1          8A  O 16 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  48                                  DSPATR(ND)
     A                                 16 26'---'
     A                                      DSPATR(RI)
     A            L32C2          8A  O 16 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  58                                  DSPATR(ND)
     A                                 16 39'---'
     A                                      DSPATR(RI)
     A            L32C3          8A  O 16 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  68                                  DSPATR(ND)
     A                                 16 53'- '
     A                                      DSPATR(RI)
     A                                 17 13' '
     A                                      DSPATR(RI)
     A            L33C1          8A  O 17 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  49                                  DSPATR(ND)
     A                                 17 27' '
     A                                      DSPATR(RI)
     A            L33C2          8A  O 17 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  59                                  DSPATR(ND)
     A                                 17 40' '
     A                                      DSPATR(RI)
     A            L33C3          8A  O 17 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  69                                  DSPATR(ND)
     A                                 17 54' '
     A                                      DSPATR(RI)
     A                                 18 13' '
     A                                      DSPATR(RI)
     A                                 18 27' '
     A                                      DSPATR(RI)
     A                                 18 40' '
     A                                      DSPATR(RI)
     A                                 18 54' '
     A                                      DSPATR(RI)
     A                                 19 13' '
     A                                      DSPATR(RI)
     A                                 19 27' '
     A                                      DSPATR(RI)
     A                                 19 40' '
     A                                      DSPATR(RI)
     A                                 19 54' '
     A                                      DSPATR(RI)
     A                                 20 13'                                  -
     A                                              '
     A                                      DSPATR(RI)
     A                                 23 22'Bet (1-3) ?'
     A            #BET           1D 0B 23 35RANGE(1 3)
     A                                      DSPATR(MDT)
     A                                 24  2'F3=Exit'
     A*
     A*
     A*****************************************************************
     A*
     A          R REC1
     A**                                    KEEP
     A                                  2 13'                                  -
     A                                              '
     A                                      DSPATR(RI)
     A                                  3 13' '
     A                                      DSPATR(RI)
     A                                  3 27' '
     A                                      DSPATR(RI)
     A                                  3 40' '
     A                                      DSPATR(RI)
     A                                  3 54' '
     A                                      DSPATR(RI)
     A                                  4 13' '
     A                                      DSPATR(RI)
     A                                  4 27' '
     A                                      DSPATR(RI)
     A                                  4 40' '
     A                                      DSPATR(RI)
     A                                  4 54' '
     A                                      DSPATR(RI)
     A                                  5 13' '
     A                                      DSPATR(RI)
     A                                  5 27' '
     A                                      DSPATR(RI)
     A                                  5 40' '
     A                                      DSPATR(RI)
     A                                  5 54' '
     A                                      DSPATR(RI)
     A                                  6  9'2'
     A  32                                  DSPATR(HI)
     A                                  6 13' -'
     A                                      DSPATR(RI)
     A                                  6 26'---'
     A                                      DSPATR(RI)
     A                                  6 39'---'
     A                                      DSPATR(RI)
     A                                  6 53'- '
     A                                      DSPATR(RI)
     A                                  7 13' '
     A                                      DSPATR(RI)
     A                                  7 27' '
     A                                      DSPATR(RI)
     A                                  7 40' '
     A                                      DSPATR(RI)
     A                                  7 54' '
     A                                      DSPATR(RI)
     A                                  8 13' '
     A                                      DSPATR(RI)
     A                                  8 27' '
     A                                      DSPATR(RI)
     A                                  8 40' '
     A                                      DSPATR(RI)
     A                                  8 54' '
     A                                      DSPATR(RI)
     A                                  9 13' '
     A                                      DSPATR(RI)
     A                                  9 27' '
     A                                      DSPATR(RI)
     A                                  9 40' '
     A                                      DSPATR(RI)
     A                                  9 54' '
     A                                      DSPATR(RI)
     A                                 10 13' '
     A                                      DSPATR(RI)
     A                                 10 27' '
     A                                      DSPATR(RI)
     A                                 10 40' '
     A                                      DSPATR(RI)
     A                                 10 54' '
     A                                      DSPATR(RI)
     A                                 11  9'1'
     A  31                                  DSPATR(HI)
     A                                 11 13' -'
     A                                      DSPATR(RI)
     A                                 11 26'---'
     A                                      DSPATR(RI)
     A                                 11 39'---'
     A                                      DSPATR(RI)
     A                                 11 53'- '
     A                                      DSPATR(RI)
     A                                 12 13' '
     A                                      DSPATR(RI)
     A                                 12 27' '
     A                                      DSPATR(RI)
     A                                 12 40' '
     A                                      DSPATR(RI)
     A                                 12 54' '
     A                                      DSPATR(RI)
     A                                 13 13' '
     A                                      DSPATR(RI)
     A                                 13 27' '
     A                                      DSPATR(RI)
     A                                 13 40' '
     A                                      DSPATR(RI)
     A                                 13 54' '
     A                                      DSPATR(RI)
     A                                 14 13' '
     A                                      DSPATR(RI)
     A                                 14 27' '
     A                                      DSPATR(RI)
     A                                 14 40' '
     A                                      DSPATR(RI)
     A                                 14 54' '
     A                                      DSPATR(RI)
     A                                 15 13' '
     A                                      DSPATR(RI)
     A                                 15 27' '
     A                                      DSPATR(RI)
     A                                 15 40' '
     A                                      DSPATR(RI)
     A                                 15 54' '
     A                                      DSPATR(RI)
     A                                 16  9'3'
     A  33                                  DSPATR(HI)
     A                                 16 13' -'
     A                                      DSPATR(RI)
     A                                 16 26'---'
     A                                      DSPATR(RI)
     A                                 16 39'---'
     A                                      DSPATR(RI)
     A                                 16 53'- '
     A                                      DSPATR(RI)
     A                                 17 13' '
     A                                      DSPATR(RI)
     A                                 17 27' '
     A                                      DSPATR(RI)
     A                                 17 40' '
     A                                      DSPATR(RI)
     A                                 17 54' '
     A                                      DSPATR(RI)
     A                                 18 13' '
     A                                      DSPATR(RI)
     A                                 18 27' '
     A                                      DSPATR(RI)
     A                                 18 40' '
     A                                      DSPATR(RI)
     A                                 18 54' '
     A                                      DSPATR(RI)
     A                                 19 13' '
     A                                      DSPATR(RI)
     A                                 19 27' '
     A                                      DSPATR(RI)
     A                                 19 40' '
     A                                      DSPATR(RI)
     A                                 19 54' '
     A                                      DSPATR(RI)
     A                                 20 13'                                  -
     A                                              '
     A                                      DSPATR(RI)
     A                                 24  2'F3=Exit'
     A*
     A*****************************************************************
     A*
     A          R REC2
     A                                      OVERLAY
     A                                      CLRL(*NO)
     A                                      FRCDTA
     A                                      PUTOVR
     A*
     A*  Refresh Side Lines & Number
     A                                  6  9'2'
     A  32                                  DSPATR(HI)
     A                                      OVRATR
     A                                  6 26'---'
     A                                      DSPATR(RI)
     A                                      OVRATR
     A                                  6 39'---'
     A                                      DSPATR(RI)
     A                                      OVRATR
     A                                 11  9'1'
     A  31                                  DSPATR(HI)
     A                                      OVRATR
     A                                 11 26'---'
     A                                      DSPATR(RI)
     A                                      OVRATR
     A                                 11 39'---'
     A                                      DSPATR(RI)
     A                                      OVRATR
     A                                 16  9'3'
     A  33                                  DSPATR(HI)
     A                                      OVRATR
     A                                 16 26'---'
     A                                      DSPATR(RI)
     A                                      OVRATR
     A                                 16 39'---'
     A                                      DSPATR(RI)
     A                                      OVRATR
     A*
     A*  Refresh 'Win Meter' Scores
     A            CREDIT         5Y 0O  4 72EDTCDE(P)
     A                                      OVRATR
     A                                      OVRDTA
     A            LSTWIN         5Y 0O  6 72EDTCDE(P)
     A                                      OVRATR
     A                                      OVRDTA
     A            CURWIN         5Y 0O  8 72EDTCDE(P)
     A                                      OVRATR
     A                                      OVRDTA
     A            #LBET          1Y 0O 10 77EDTCDE(3)
     A                                      OVRATR
     A                                      OVRDTA
     A*
     A*  Refresh 'Spinning Wheels'
     A            L11C1          8A  O  5 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  41                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L11C2          8A  O  5 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  51                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L11C3          8A  O  5 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  61                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L12C1          8A  O  6 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  42                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L12C2          8A  O  6 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  52                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L12C3          8A  O  6 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  62                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L13C1          8A  O  7 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  43                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L13C2          8A  O  7 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  53                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L13C3          8A  O  7 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  63                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L21C1          8A  O 10 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  44                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L21C2          8A  O 10 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  54                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L21C3          8A  O 10 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  64                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L22C1          8A  O 11 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  45                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L22C2          8A  O 11 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  55                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L22C3          8A  O 11 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  65                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L23C1          8A  O 12 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  46                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L23C2          8A  O 12 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  56                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L23C3          8A  O 12 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  66                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L31C1          8A  O 15 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  47                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L31C2          8A  O 15 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  57                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L31C3          8A  O 15 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  67                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L32C1          8A  O 16 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  48                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L32C2          8A  O 16 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  58                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L32C3          8A  O 16 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  68                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L33C1          8A  O 17 17DSPATR(RI)
     A                                      DSPATR(UL)
     A  49                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L33C2          8A  O 17 30DSPATR(RI)
     A                                      DSPATR(UL)
     A  59                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A            L33C3          8A  O 17 43DSPATR(RI)
     A                                      DSPATR(UL)
     A  69                                  DSPATR(ND)
     A                                      OVRATR
     A                                      OVRDTA
     A*
     A*****************************************************************
     A*
     A          R WINMTR
     A                                      FRCDTA
     A                                      USRRSTDSP
     A                                      WINDOW(2 60 10 16 *NOMSGLIN *NORSTC-
     A                                      SR)
     A                                      WDWBORDER((*COLOR PNK) (*DSPATR RI)-
     A                                       (*CHAR '********'))
     A                                  1  5'WIN METER'
     A                                      DSPATR(HI)
     A                                      COLOR(TRQ)
     A                                  3  1'Credit'
     A            CREDIT         5S 0O  3 12
     A                                  5  1'Last Win'
     A            LSTWIN         5S 0O  5 12
     A                                  7  1'Curr.Win'
     A            CURWIN         5S 0O  7 12
     A                                  9  1'#Lines/Bet'
     A            #LBET          1  0O  9 16
