     A*****************************************************************
     A* File Name : WRDSCHD  ( Type - DSPF )
     A* Purpose   : Display File For Word Search
     A* Written   : N.Shankar
     A* Dated     : Jan. 19, 1998.
     A*****************************************************************
     A*
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A*
     A*****************************************************************
     A*
     A          R DUMMY
     A                                      ASSUME
     A                                  1  2' '
     A*
     A*****************************************************************
     A*
     A          R FOOTER
     A                                 24  2'F3=Exit'
     A                                 24 23'F6=Search Word'
     A                                 24 51'F7=Reset Previous Indicators'
     A*
     A*****************************************************************
     A*
     A          R REC2
     A                                      CA12(12 'Cancel')
     A                                      OVERLAY
     A                                      WINDOW(19 20 4 40 *NOMSGLIN)
     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
     A                                          '))
     A                                  2  2'Enter Search Word :'
     A            WORD          11A  B  2 24
     A                                  4  2'F12=Cancel'
     A*
     A*****************************************************************
     A*
     A          R SUBFL                     SFL
     A                                      SFLNXTCHG
     A            HIND01         1   H
     A            HIND02         1   H
     A            HIND03         1   H
     A            HIND04         1   H
     A            HIND05         1   H
     A            HIND06         1   H
     A            HIND07         1   H
     A            HIND08         1   H
     A            HIND09         1   H
     A            HIND10         1   H
     A            HIND11         1   H
     A            FLD001         1   B  6 11
     A     61                               DSPATR(RI)
     A            FLD002         1   B  6 13
     A     62                               DSPATR(RI)
     A            FLD003         1   B  6 15
     A     63                               DSPATR(RI)
     A            FLD004         1   B  6 17
     A     64                               DSPATR(RI)
     A            FLD005         1   B  6 19
     A     65                               DSPATR(RI)
     A            FLD006         1   B  6 21
     A     66                               DSPATR(RI)
     A            FLD007         1   B  6 23
     A     67                               DSPATR(RI)
     A            FLD008         1   B  6 25
     A     68                               DSPATR(RI)
     A            FLD009         1   B  6 27
     A     69                               DSPATR(RI)
     A            FLD010         1   B  6 29
     A     70                               DSPATR(RI)
     A            FLD011         1   B  6 31
     A     71                               DSPATR(RI)
     A*
     A*****************************************************************
     A*
     A          R SUBCTL                    SFLCTL(SUBFL)
     A                                      SFLSIZ(0011)
     A                                      SFLPAG(0011)
     A                                      OVERLAY
     A                                      CA03(03 'Exit')
     A                                      CF06(06 'Search Word')
     A                                      CF07(07 'Reset Indicators')
     A N40                                  SFLDSP
     A N40                                  SFLDSPCTL
     A  40                                  SFLINZ
     A            RECNO          4  0H      SFLRCDNBR
     A                                  1  2DATE
     A                                      EDTCDE(Y)
     A                                      DSPATR(HI)
     A                                  1 34'WORD SEARCH'
     A                                      DSPATR(HI)
     A            WSID          10   O  1 70DSPATR(HI)
     A                                  2  2TIME
     A                                      DSPATR(HI)
     A                                  2 70USER
     A                                      DSPATR(HI)
